Repository: AluminumOxide/flask-starter
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

# error.user-does-not-exist
source: Sorry! We can't find that user.
fr: Pardon! Nous ne pouvon pas trouver ce compte.

# error.invalid-email-verification-code
source: Sorry! That email verification code doesn't match our records.
fr: Pardon! Ce code de vérification ne correspond pas à nos dossiers.

# error.invalid-values
source: Invalid value(s)
fr: Valeur(s) incorrect(s)

# error.user-name-min-len
source: Name must be at least %(l)d characters long.
fr: Le nom doit contenir au moins %(l)d caractères.

# error.user-name-max-len
source: Name must be at most %(l)d characters long.
fr: Le nom doit contenir au plus %(l)d caractères.

# error.user-name-alphanumeric
source: Name contains non-alphanumeric characters.
fr: Le nom contient des caractères non alphanumériques.

# error.user-name-not-unique
source: Name is not unique.
fr: Le nom n'est pas unique.

# error.user-email-min-len
source: Email must be at least %(l)d characters long.
fr: Le courriel doit contenir au moins %(l)d caractères.

# error.user-email-max-len
source: Email must be at most %(l)d characters long.
fr: Le courriel doit contenir au plus %(l)d caractères.

# error.user-email-missing-at
source: Email must contain a '@'.
fr: Le courriel doit contenir un '@'.

# error.user-email-missing-period
source: Email must contain a '.'.
fr: Le courriel doit contenir un '.'.

# error.user-email-not-unique
source: Email is not unqiue.
fr: Le courriel n'est pas unique.

# error.user-password-min-len
source: Password must be at least %(l)d characters long.
fr: Le mot de passe doit contenir au moins %(l)d caractères.

# error.user-password-max-len
source: Password must be at most %(l)d characters long.
fr: Le mot de passe doit contenir au plus %(l)d caractères.

# error.user-lang-min-len
source: Language must be at least %(l)d characters long.
fr: La langue doit contenir au moins %(l)d caractères.

# error.user-lang-max-len
source: Language must be at most %(l)d characters long.
fr: La langue doit contenir au plus %(l)d caractères.

# button-sign-up
source: Sign Up!
fr: S'inscrire!

# title-account-management
source: Account Management
fr: Votre Compte

# error-account-fix-and-resubmit
source: Please fix the following errors and resubmit.
fr: Veuillez corriger les erreurs suivantes et renvoyer.

# label-user-name
source: Name
fr: Nom

# error-user-invalid-name
source: Invalid Name
fr: Nom incorrect

# label-user-email
source: Email
fr: Courriel

# error-user-invalid-email
source: Invalid Email
fr: Courriel incorrect

# label-user-password
source: Password
fr: Mot de Passe

# error-user-invalid-password
source: Invalid Password
fr: Mot de passe incorrect

# label-user-lang
source: Language
fr: Langue

# error-user-invalid-lang
source: Invalid Language
fr: Langue incorrect

# button-update-account
source: Update Account!
fr: Modifier le Compte

# title-delete-account
source: Delete Account
fr: Supprimer le Compte

# disclaimer-delete-account
source: I understand that this will delete my account, but not all data associated with the account, and I will be able to recover the account.
fr: Je comprends que cela va supprimer mon compte, mais pas toutes les données associées au compte, et je serai en mesure de récupérer le compte.

# button-delete-account
source: Delete Account!
fr: Supprimer!

# title-purge-account
source: Purge Account
fr: Purger le Compte

# disclaimer-purge-account
source: I understand that this will delete my account, and all my account data, and I will not be able to recover the account.
fr: Je comprends que cela va purger mon compte, et toutes mes données de compte, et je ne serai pas en mesure de récupérer le compte.

# button-purge-account
source: Purge Account!
fr: Purger!

# title-create-account
source: Create Account
fr: Créer un Compte

# button-create-account
source: Create Account!
fr: Créer!

# success-account-purged
source: Your account has been successfully purged.
fr: Votre compte a été purgé avec succès.

# title-recover-deleted-account
source: Recover Deleted Account
fr: Récupérer un compte supprimé

# title-recover-user-name
source: Recover Lost Name
fr: Récupérer votre nom

# title-recover-password
source: Recover Lost Password
fr: Récupérer votre mot de passe

# title-verify-account-email
source: Verify Email
fr: Vérifier le courriel

# account-email-verify-to-continue
source: Please verify your account to continue.
fr: Veuillez vérifier votre compte pour continuer.

# label-user-validation-code
source: Validation Code
fr: Code de Validation

# button-validate-email
source: Validate Email!
fr: Valider!

# account-email-verify-need-resend
source: Need a resend?
fr: Avez-vous besoin du code de vérification?

# button-resend-email-validation-code
source: Resend Validation Code!
fr: Renvoyer!

# title-login
source: Login
fr: S'identifier

# button-login
source: Login!
fr: Entrer!

# title-logout
source: Logout
fr: Fermer la Session

# success-user-logout
source: You have successfully been logged out.
fr: Vous avez été déconnecté avec succès.
